ГТС/УТГТС/InformationRegisters/СтатусыСборкиИДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСборкиИДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСборкиИДоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКурьера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСборщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеЗаказа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрокВЗаказе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрокСобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыСборкиИДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСборкиИДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКДоставке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/СтатусыСборкиИДоставки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает статус заказа.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказКлиента - Заказ.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыСборкиИДоставки - Текущий статус распоряжения
//
Функция ПолучитьСтатусЗаказа(Заказ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыСборкиИДоставки.Статус КАК Статус,
	|	СтатусыСборкиИДоставки.ДанныеЗаказа КАК ДанныеЗаказа
	|ИЗ
	|	РегистрСведений.СтатусыСборкиИДоставки КАК СтатусыСборкиИДоставки
	|ГДЕ
	|	СтатусыСборкиИДоставки.Распоряжение = &Распоряжение";

	Запрос.УстановитьПараметр("Распоряжение", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Статус;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает промежуточно сохраненные данные заказа.
//
// Параметры:
//  Распоряжение - ДокументСсылка.ЗаказКлиента - Заказ.
//
// Возвращаемое значение:
//  ХранилищеЗначения - сохраненные промежуточные данные сборки.
//
Функция ПолучитьПромежуточныеДанныеСборки(Распоряжение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыСборкиИДоставки.ДанныеЗаказа КАК ДанныеЗаказа
	|ИЗ
	|	РегистрСведений.СтатусыСборкиИДоставки КАК СтатусыСборкиИДоставки
	|ГДЕ
	|	СтатусыСборкиИДоставки.Распоряжение = &Распоряжение";

	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ДанныеЗаказа;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Записывает статус переданного распоряжения.
// 
// Параметры:
// 	Распоряжение - ДокументСсылка.ЗаказКлиента, ДокументСсылка.РеализацияТоваровУслуг - 
// 	Отказ - Булево
// 	УдалениеПроведения - Булево
//
Процедура ЗаписатьСтатусИзРаспоряжения(Распоряжение, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		СтатусЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "Статус");
		Если СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
			УдалитьЗаписьСоСтатусом(Распоряжение);
			Возврат;
		КонецЕсли;
		
		ТоварыРаспоряжения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "Товары").Выгрузить(); // ТаблицаЗначений
		
		Если СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
			КоличествоСтрок = ТоварыРаспоряжения.Количество();
			
			ПараметрыПоиска = Новый Структура("Отменено", Истина);
			ОтмененныеСтроки = ТоварыРаспоряжения.НайтиСтроки(ПараметрыПоиска);
			
			Если КоличествоСтрок = ОтмененныеСтроки.Количество() Тогда
				РегистрыСведений.СтатусыСборкиИДоставки.ЗаписатьСтатус(Распоряжение, Перечисления.СтатусыСборкиИДоставки.Отменен);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УдалениеПроведения Тогда
		УдалитьЗаписьСоСтатусом(Распоряжение);
		Возврат
	КонецЕсли;
	
	СтатусУстановлен = СтатусРаспоряженияУстановлен(Распоряжение);
	
	Если СтатусУстановлен Тогда
		Возврат;
	КонецЕсли;
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "Склад");
	ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "Дата");
	
	СборкаПоддерживается = СкладыСервер.ЕстьПоддержкаСборкиЗаказов(Склад, ДатаДокумента);
	Если СборкаПоддерживается Тогда
		Статус = Перечисления.СтатусыСборкиИДоставки.КСборке;
		ЗаписатьСтатус(Распоряжение, Статус);
		Возврат;
	КонецЕсли;
	
	ДоставкаПоддерживается = СкладыСервер.ЕстьПоддержкаДоставкиСвоимиКурьерами(Склад, ДатаДокумента);
	Если ДоставкаПоддерживается Тогда
		Статус = Перечисления.СтатусыСборкиИДоставки.ГотовКДоставке;
		ЗаписатьСтатус(Распоряжение, Статус);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает статус переданному распоряжению.
// 
// Параметры:
// 	Распоряжение - ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.ЗаказКлиента - 
// 	Статус - ПеречислениеСсылка.СтатусыСборкиИДоставки
//
Процедура ЗаписатьСтатус(Распоряжение, Статус) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.СтатусыСборкиИДоставки.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Распоряжение = Распоряжение;
	ЗаписьРегистра.Прочитать();
	
	ЗаписьРегистра.Распоряжение = Распоряжение;
	ЗаписьРегистра.Статус = Статус;

	ТоварыРаспоряжения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "Товары").Выгрузить(); // ТаблицаЗначений
	ЗаписьРегистра.КоличествоСтрокВЗаказе = ТоварыРаспоряжения.Количество();
	
	Попытка
		ЗаписьРегистра.Записать(Истина);
	Исключение
		ТекстОшибки = НСтр("ru='Не удалось записать статус.'");
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Записывает промежуточную информацию по сборке.
// 
// Параметры:
// 	Распоряжение - ДокументСсылка.ЗаказКлиента, ДокументСсылка.РеализацияТоваровУслуг - 
// 	Данные - ХранилищеЗначения
// 	КоличествоСтрокСобрано - Число
//
Процедура ЗаписатьПромежуточныеДанныеСборки(Распоряжение, Данные, КоличествоСтрокСобрано) Экспорт
	
	НаборЗаписей = РегистрыСведений.СтатусыСборкиИДоставки.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Распоряжение.Установить(Распоряжение);
	НаборЗаписей.Прочитать(); 
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ДанныеЗаказа = Данные;
		Запись.КоличествоСтрокСобрано = КоличествоСтрокСобрано;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтатусРаспоряженияУстановлен(Распоряжение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСборкиИДоставки.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыСборкиИДоставки КАК СтатусыСборкиИДоставки
		|ГДЕ
		|	СтатусыСборкиИДоставки.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура УдалитьЗаписьСоСтатусом(Распоряжение)
	
	Набор = РегистрыСведений.СтатусыСборкиИДоставки.СоздатьНаборЗаписей();
	Набор.Отбор.Распоряжение.Установить(Распоряжение);
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
